cf/Documents/SalesInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>SalesInvoice</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.GoodsInWarehouses</xr:Item>
				<xr:Item>AccumulationRegister.Sales</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Carrier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Carriers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SalesInvoiceStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TotalAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Services</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Service</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/SalesInvoice/Ext/ManagerModule.bsl
Function PrintFormSalesInvoice(PrintingObjects) Export
	
	SpreadsheetDocument = New SpreadsheetDocument;
	SpreadsheetDocument.ShowGrid = False;
	
	SpreadsheetDocument.PrintParametersKey = "SalesInvoice_SalesInvoice";
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	SalesInvoice.Number AS DocumentNumber,
	|	SalesInvoice.Date AS DocumentDate,
	|	SalesInvoice.Company AS Company,
	|	SalesInvoice.Customer AS Customer,
	|	SalesInvoice.Contract AS Contract,
	|	SalesInvoice.TotalAmount AS TotalAmount,
	|	SalesInvoice.Responsible AS Responsible,
	|	SalesInvoice.Warehouse AS Warehouse,
	|	SalesInvoice.Products.(
	|		LineNumber AS LineNumber,
	|		Product AS Product,
	|		Quantity AS Quantity,
	|		Price AS Price,
	|		Amount AS Amount
	|	) AS Products,
	|	SalesInvoice.Services.(
	|		LineNumber AS LineNumber,
	|		Service AS Service,
	|		Quantity AS Quantity,
	|		Price AS Price,
	|		Amount AS Amount
	|	) AS Services
	|FROM
	|	Document.SalesInvoice AS SalesInvoice
	|WHERE
	|	SalesInvoice.Ref IN(&PrintingObjects)";
	
	Query.SetParameter("PrintingObjects", PrintingObjects);
	
	Selection = Query.Execute().Select();
	
	Template = Documents.SalesInvoice.GetTemplate("PF_SalesInvoice");
	
	AreaTitle 				= Template.GetArea("Title");
	AreaHeader 				= Template.GetArea("Header");
	AreaHeaderProducts 		= Template.GetArea("HeaderProducts");
	AreaTableRowProducts 	= Template.GetArea("TableRowProducts");
	AreaHeaderServices 		= Template.GetArea("HeaderServices");
	AreaTableRowServices 	= Template.GetArea("TableRowServices");
	AreaTotals 				= Template.GetArea("Totals");
	AreaFooter 				= Template.GetArea("Footer");
	
	InsertPageBreak = False;
	While Selection.Next() Do
		If InsertPageBreak Then
			SpreadsheetDocument.PutHorizontalPageBreak();
		EndIf;
		
		AreaTitle.Parameters.Fill(Selection);
		AreaTitle.Parameters.DocumentDate = Format(Selection.DocumentDate, "DLF=DD");
		
		CompanyLogo = Catalogs.Companies.CompanyLogo(Selection.Company);
		If TypeOf(CompanyLogo) = Type("BinaryData") Then
			Picture = New Picture(CompanyLogo);
			AreaTitle.Drawings.Logo.Picture = Picture;
		EndIf;
		
		SpreadsheetDocument.Put(AreaTitle);
		
		AreaHeader.Parameters.Fill(Selection);
		SpreadsheetDocument.Put(AreaHeader);
				
		SelectionProducts = Selection.Products.Select();
		If SelectionProducts.Count() > 0 Then
			SpreadsheetDocument.Put(AreaHeaderProducts);
			
			While SelectionProducts.Next() Do
				AreaTableRowProducts.Parameters.Fill(SelectionProducts);
				SpreadsheetDocument.Put(AreaTableRowProducts);				
			EndDo;

		EndIf;
		
		SelectionServices = Selection.Services.Select();
		If SelectionServices.Count() > 0 Then
			SpreadsheetDocument.Put(AreaHeaderServices);
			
			While SelectionServices.Next() Do
				AreaTableRowServices.Parameters.Fill(SelectionServices);
				SpreadsheetDocument.Put(AreaTableRowServices);			
			EndDo;

		EndIf;	
		
		AreaTotals.Parameters.TotalAmount = Format(Selection.TotalAmount, "NG=3");
		SpreadsheetDocument.Put(AreaTotals);
		
		AreaFooter.Parameters.Fill(Selection);
		SpreadsheetDocument.Put(AreaFooter);
		
		InsertPageBreak = True;
	EndDo;
	
	SpreadsheetDocument.FitToPage = True;
	
	Return SpreadsheetDocument;
	
EndFunction
